### Day 7 — Pandas Data Manipulation (GroupBy, Merge, Join)

In [1]:
import pandas as pd

##### 1. Creating sample DataFrames

In [2]:
df = pd.DataFrame({
    'Name': ['Amit', 'Riya', 'John', 'Sara', 'Amit'],
    'City': ['Delhi', 'Mumbai', 'Delhi', 'London', 'Delhi'],
    'Score': [88, 92, 75, 95, 80],
    'Age': [25, 22, 29, 24, 25]
})

In [3]:
print("Main DataFrame:")
print(df)

Main DataFrame:
   Name    City  Score  Age
0  Amit   Delhi     88   25
1  Riya  Mumbai     92   22
2  John   Delhi     75   29
3  Sara  London     95   24
4  Amit   Delhi     80   25

##### 2. GroupBy — Aggregate Data

In [4]:
print("\nGroup by City — Average Score:")
print(df.groupby('City')['Score'].mean())

Group by City — Average Score:
City
Delhi     81.0
London    95.0
Mumbai    92.0
Name: Score, dtype: float64

In [5]:
print("\nGroup by Name — Total Score & Max Age:")
print(df.groupby('Name').agg({'Score': 'sum', 'Age': 'max'}))

Group by Name — Total Score & Max Age:
      Score  Age
Name
Amit    168   25
John     75   29
Riya     92   22
Sara     95   24

##### 3. Sorting values

In [6]:
print("\nSort by Age:")
print(df.sort_values(by='Age'))

Sort by Age:
   Name    City  Score  Age
1  Riya  Mumbai     92   22
3  Sara  London     95   24
0  Amit   Delhi     88   25
4  Amit   Delhi     80   25
2  John   Delhi     75   29

In [7]:
print("\nSort by Score descending:")
print(df.sort_values(by='Score', ascending=False))

Sort by Score descending:
   Name    City  Score  Age
3  Sara  London     95   24
1  Riya  Mumbai     92   22
0  Amit   Delhi     88   25
4  Amit   Delhi     80   25
2  John   Delhi     75   29

##### 4. Merge two DataFrames

In [8]:
students = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'Name': ['Amit', 'Riya', 'John', 'Sara']
})

marks = pd.DataFrame({
    'ID': [1, 2, 3, 4],
    'Math': [90, 85, 70, 95],
    'Science': [88, 92, 75, 98]
})

In [9]:
merged = pd.merge(students, marks, on='ID')
print("\nMerged DataFrame:")
print(merged)

Merged DataFrame:
   ID  Name  Math  Science
0   1  Amit    90       88
1   2  Riya    85       92
2   3  John    70       75
3   4  Sara    95       98